ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/MCU_ESM0_CFG.xml
<module name="MCU_ESM0_CFG" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CFG_PID" acronym="CFG_PID" offset="0x0" width="32" description="The Revision Register contains the major and minor revisions for the module.">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="PID register scheme" range="31 - 30" rwaccess="R"/> 
		<bitfield id="BU" width="2" begin="29" end="28" resetval="0x2" description="Business Unit: 10 = Processors" range="29 - 28" rwaccess="R"/> 
		<bitfield id="FUNC" width="12" begin="27" end="16" resetval="0x4064" description="Module ID" range="27 - 16" rwaccess="R"/> 
		<bitfield id="RTL" width="5" begin="15" end="11" resetval="0x9" description="RTL revision. Will vary depending on release." range="15 - 11" rwaccess="R"/> 
		<bitfield id="MAJOR" width="3" begin="10" end="8" resetval="0x1" description="Major revision" range="10 - 8" rwaccess="R"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom" range="7 - 6" rwaccess="R"/> 
		<bitfield id="MINOR" width="6" begin="5" end="0" resetval="0x0" description="Minor revision" range="5 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_INFO" acronym="CFG_INFO" offset="0x4" width="32" description="The Info Register gives the configuration Inforrmation of this ESM.">
		<bitfield id="LAST_RESET" width="1" begin="31" end="31" resetval="0x0" description="Indicates the Source of the last Reset" range="31" rwaccess="R"/> 
		<bitfield id="PULSE_GROUPS" width="8" begin="15" end="8" resetval="0x1" description="Number of Pulse Error Groups" range="15 - 8" rwaccess="R"/> 
		<bitfield id="GROUPS" width="8" begin="7" end="0" resetval="0x3" description="Total number of Error Groups" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_EN" acronym="CFG_EN" offset="0x8" width="32" description="The Global Enable Register has the master interrupt mask">
		<bitfield id="KEY" width="4" begin="3" end="0" resetval="0x0" description="Global Enable" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_SFT_RST" acronym="CFG_SFT_RST" offset="0xC" width="32" description="The Global Soft Reset Register controls the global clear for raw status and enables">
		<bitfield id="KEY" width="4" begin="3" end="0" resetval="0x0" description="Global Soft Reset" range="3 - 0" rwaccess="W"/>
	</register>
	<register id="CFG_ERR_RAW" acronym="CFG_ERR_RAW" offset="0x10" width="32" description="Raw Status/Set Register for Configuration Errors">
		<bitfield id="STS" width="3" begin="2" end="0" resetval="0x0" description="This is the raw status for config errors" range="2 - 0" rwaccess="R/W1TS"/>
	</register>
	<register id="CFG_ERR_STS" acronym="CFG_ERR_STS" offset="0x14" width="32" description="Config Error Enable and Clear Register">
		<bitfield id="MSK" width="3" begin="2" end="0" resetval="0x0" description="This is the masked status/clear for config errors" range="2 - 0" rwaccess="R/W1TC"/>
	</register>
	<register id="CFG_ERR_EN_SET" acronym="CFG_ERR_EN_SET" offset="0x18" width="32" description="Config Error Enable Set Register">
		<bitfield id="MSK" width="3" begin="2" end="0" resetval="0x0" description="This is the mask enable set for config errors" range="2 - 0" rwaccess="R/W1TS"/>
	</register>
	<register id="CFG_ERR_EN_CLR" acronym="CFG_ERR_EN_CLR" offset="0x1C" width="32" description="Config Error Interrupt Enabled Clear register">
		<bitfield id="MSK" width="3" begin="2" end="0" resetval="0x0" description="This is the mask enable clear for config errors" range="2 - 0" rwaccess="R/W1TC"/>
	</register>
	<register id="CFG_LOW_PRI" acronym="CFG_LOW_PRI" offset="0x20" width="32" description="Shows which is the highest priority outstanding low priority interrupt">
		<bitfield id="PLS" width="16" begin="31" end="16" resetval="0x65535" description="This is the highest priority outstanding low priority pulse interrupt" range="31 - 16" rwaccess="R"/> 
		<bitfield id="LVL" width="16" begin="15" end="0" resetval="0x65535" description="This is the highest priority outstanding low priority level interrupt" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_HI_PRI" acronym="CFG_HI_PRI" offset="0x24" width="32" description="Shows which is the highest priority outstanding high priority interrupt">
		<bitfield id="PLS" width="16" begin="31" end="16" resetval="0x65535" description="This is the highest priority outstanding high priority pulse interrupt" range="31 - 16" rwaccess="R"/> 
		<bitfield id="LVL" width="16" begin="15" end="0" resetval="0x65535" description="This is the highest priority outstanding high priority level interrupt" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_LOW" acronym="CFG_LOW" offset="0x28" width="32" description="Shows which groups have oustanding low priority interrupts">
		<bitfield id="STS" width="32" begin="31" end="0" resetval="0x0" description="This is the raw status for config errors" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_HI" acronym="CFG_HI" offset="0x2C" width="32" description="Shows which groups have oustanding high priority interrupts">
		<bitfield id="STS" width="32" begin="31" end="0" resetval="0x0" description="This is the raw status for config errors" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_EOI" acronym="CFG_EOI" offset="0x30" width="32" description="End of Interrupt Register">
		<bitfield id="KEY" width="11" begin="10" end="0" resetval="0x0" description="This is the interrupt being serviced" range="10 - 0" rwaccess="W"/>
	</register>
	<register id="CFG_PIN_CTRL" acronym="CFG_PIN_CTRL" offset="0x40" width="32" description="This register controls the error_pin_n output">
		<bitfield id="PWM_EN" width="4" begin="7" end="4" resetval="0x0" description="PWM enable" range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="KEY" width="4" begin="3" end="0" resetval="0x0" description="Pin Control Key" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_PIN_STS" acronym="CFG_PIN_STS" offset="0x44" width="32" description="This register reflects the status of the error_pin_n output">
		<bitfield id="VAL" width="1" begin="0" end="0" resetval="0x0" description="Value of the error_pin_n" range="0" rwaccess="R"/>
	</register>
	<register id="CFG_PIN_CNTR" acronym="CFG_PIN_CNTR" offset="0x48" width="32" description="This register shows the current value of the error pin counter">
		<bitfield id="COUNT" width="24" begin="23" end="0" resetval="0x0" description="Current Counter Value" range="23 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_PIN_CNTR_PRE" acronym="CFG_PIN_CNTR_PRE" offset="0x4C" width="32" description="This register contains the value that is loaded in to the Error Counter">
		<bitfield id="COUNT" width="24" begin="23" end="0" resetval="0x0" description="Counter Pre-Load Value" range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_PWMH_PIN_CNTR" acronym="CFG_PWMH_PIN_CNTR" offset="0x50" width="32" description="This register shows the current value of the error pin PWM high counter">
		<bitfield id="COUNT" width="24" begin="23" end="0" resetval="0x0" description="Current Counter Value" range="23 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_PWMH_PIN_CNTR_PRE" acronym="CFG_PWMH_PIN_CNTR_PRE" offset="0x54" width="32" description="This register contains the value that is loaded in to the Error PWM High Counter">
		<bitfield id="COUNT" width="24" begin="23" end="0" resetval="0x0" description="Counter Pre-Load Value" range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_PWML_PIN_CNTR" acronym="CFG_PWML_PIN_CNTR" offset="0x58" width="32" description="This register shows the current value of the error pin PWM low counter">
		<bitfield id="COUNT" width="24" begin="23" end="0" resetval="0x0" description="Current Counter Value" range="23 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_PWML_PIN_CNTR_PRE" acronym="CFG_PWML_PIN_CNTR_PRE" offset="0x5C" width="32" description="This register contains the value that is loaded in to the Error PWM Low Counter">
		<bitfield id="COUNT" width="24" begin="23" end="0" resetval="0x0" description="Counter Pre-Load Value" range="23 - 0" rwaccess="R/W"/>
	</register>
</module>